app/controllers/movies_controller.rb

    end

    if @ratings and @sort_by
      @movies = Movie.where(:rating => @ratings.keys).order(@sort_by)
    elsif @ratings
      @movies = Movie.where(:rating => @ratings.keys)
    elsif @sort_by
      @movies = Movie.order(@sort_by)
---
SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."R" = '1' AND "rating"."PG-13" = '1'
SELECT "movies".* FROM "movies"  ORDER BY release_date